[
    {
        "date": "09-30-24", 
        "title": "California governor blocks landmark AI safety bill", 
        "body": "The governor of California Gavin Newsom has blocked a landmark artificial intelligence (AI) safety bill, which had faced strong opposition from major technology companies. The legislation would have imposed some of the first regulations on AI in the US.", 
        "url": "https://www.bbc.co.uk/news/articles/cj9jwyr3kgeo", 
        "image": "https://ichef.bbci.co.uk/news/1024/branded_news/4811/live/4eb86ec0-7ecd-11ef-ab57-61708990aa74.jpg", 
        "source": "BBC", 
        "summary": "- California Governor Gavin Newsom vetoed a significant AI safety bill.\n- The bill aimed to establish safety standards for artificial intelligence technologies.\n- Newsom expressed concerns that the bill could hinder innovation and economic growth.\n- The legislation was designed to address potential risks associated with AI, including bias and misinformation.\n- Supporters of the bill argued it was necessary to protect consumers and ensure ethical AI development.\n- The veto has sparked debate over the balance between regulation and innovation in the tech industry."
    },
    {
        "date": "09-29-24", 
        "title": "California governor vetoes bill to create first-in-nation AI safety measures", 
        "body": "California Gov. Gavin Newsom has vetoed a landmark bill aimed at establishing first-in-the-nation safety measures for large artificial intelligence models.", 
        "url": "https://apnews.com/article/california-ai-safety-measures-veto-newsom-92a715a5765d1738851bb26b247bf493", 
        "image": "https://dims.apnews.com/dims4/default/9b0e993/2147483647/strip/true/crop/4032x2686+234+0/resize/599x399!/quality/90/?url=https://assets.apnews.com/64/58/a22285b6d28ada3d0eb6188559e6/bdd23ce52c604010afe31e1f9aa92b6e", 
        "source": "Associated Press", 
        "summary": "- California Governor Gavin Newsom vetoed a bill aimed at establishing the first-in-nation AI safety measures.\n- The proposed legislation sought to create guidelines for the ethical use and development of artificial intelligence.\n- Newsom cited concerns that the bill could stifle innovation and economic growth in the tech sector.\n- The bill was supported by various consumer advocacy groups who argued it was essential for protecting public safety.\n- Critics of the veto expressed disappointment, emphasizing the need for regulatory frameworks to address AI risks.\n- The decision highlights the ongoing debate over how to balance technological advancement with safety and ethical considerations."
    }, 
    {
        "date": "09-29-24", 
        "title": "California governor vetoes contentious AI safety bill", 
        "body": "California Governor Gavin Newsom on Sunday vetoed a hotly contested artificial intelligence safety bill, after the tech industry raised objections, saying it could drive AI companies from the state and hinder innovation.", 
        "url": "https://www.cnn.com/2024/09/29/tech/newsom-california-ai-safety-bill/index.html", 
        "image": "https://media.cnn.com/api/v1/images/stellar/prod/2024-06-28t034236z-1160321609-rc23k8aphlnb-rtrmadp-3-usa-election-debate-copy.jpg?c=16x9&q=w_800,c_fill", 
        "source": "CNN", 
        "summary": "- California Governor Gavin Newsom vetoed a contentious AI safety bill aimed at regulating artificial intelligence.\n- The bill sought to implement safety standards and ethical guidelines for AI technologies.\n- Newsom expressed concerns that the legislation could hinder innovation and economic growth in the tech industry.\n- Supporters of the bill argued it was necessary to protect consumers from potential AI-related harms.\n- The veto has reignited discussions about the need for regulatory measures in the rapidly evolving AI landscape.\n- Critics of the decision highlighted the importance of addressing risks associated with AI, including bias and misinformation."
    }, 
    {
        "date": "09-29-24", 
        "title": "Gavin Newsom Vetoes California's Contentious AI Safety Bill", 
        "body": "California Governor Gavin Newsom has vetoed a contentious artificial intelligence safety bill that would have required companies to make sure their AI models don't cause major harm.", 
        "url": "https://www.bloomberg.com/news/articles/2024-09-29/gavin-newsom-vetoes-california-s-contentious-ai-safety-bill", 
        "image": "https://assets.bwbx.io/images/users/iqjWHBFdfxIU/i42x2hzjhoZg/v1/1200x800.jpg", 
        "source": "Bloomberg L.P.", 
        "summary": "- California Governor Gavin Newsom vetoed a contentious AI safety bill designed to regulate artificial intelligence.\n- The bill aimed to establish safety standards and ethical guidelines for AI technologies.\n- Newsom argued that the legislation could stifle innovation and economic growth in the tech sector.\n- Proponents of the bill emphasized the need for consumer protection against potential AI risks.\n- The veto has sparked renewed debate over the balance between regulation and technological advancement.\n- Critics expressed concern that without regulation, the risks associated with AI, such as bias and misinformation, may go unaddressed."
    }, 
    {
        "date": "09-29-24", 
        "title": "California governor vetoes controversial AI bill in a win for Big Tech", 
        "body": "Tech executives opposed the measure, which would have required companies to test the most powerful AI systems before release.", 
        "url": "https://www.washingtonpost.com/technology/2024/09/29/ai-veto-california-regulation/", 
        "image": "", 
        "source": "The Washington Post", 
        "summary": "- California Governor Gavin Newsom vetoed a controversial AI regulation bill, marking a significant win for Big Tech companies.\n- The bill aimed to implement safety measures and ethical standards for artificial intelligence technologies.\n- Newsom expressed concerns that the legislation could hinder innovation and economic growth in the technology sector.\n- Supporters of the bill argued it was essential for protecting consumers from potential AI-related harms.\n- The veto has intensified discussions about the need for regulatory frameworks in the rapidly evolving AI landscape.\n- Critics of the decision warned that the lack of regulation could lead to unchecked risks associated with AI, including bias and misinformation."
    }, 
    {
        "date": "09-29-24", 
        "title": "Here is what's illegal under California's 18 (and counting) new AI laws", 
        "body": "In, California Governor Gavin Newsom considered 38 AI-related bills, including the highly contentious SB 1047, which the state's legislature", 
        "url": "https://techcrunch.com/2024/09/29/here-is-whats-illegal-under-californias-9-and-counting-new-ai-laws/", 
        "image": "https://techcrunch.com/wp-content/uploads/2024/09/GettyImages-2159615518.jpg?resize=1200,800", 
        "source": "TechCrunch", 
        "summary": "- California has introduced 18 new laws regulating artificial intelligence, addressing various legal and ethical concerns.\n- The laws aim to prevent discrimination and bias in AI systems, ensuring fair treatment across different demographics.\n- Specific illegal activities include using AI to create deepfakes for malicious purposes and manipulating consumer behavior through deceptive practices.\n- Companies are required to disclose when AI is used in decision-making processes that affect individuals.\n- The laws mandate transparency in AI algorithms, requiring companies to provide explanations for automated decisions.\n- There are penalties for failing to comply with the new regulations, emphasizing accountability in AI development and deployment.\n- The legislation reflects California's proactive approach to managing the risks associated with rapidly advancing AI technologies."
    }, 
    {
        "date": "09-29-24", 
        "title": "'Superintelligent' AI Is Only a Few Thousand Days Away: OpenAI CEO Sam Altman", 
        "body": "Altman predicts that with AI in the future, \"We will be able to do things that would have seemed like magic to our grandparents.\"", 
        "url": "https://www.cnet.com/tech/services-and-software/superintelligent-ai-is-only-a-few-thousand-days-away-openai-ceo-sam-altman/", 
        "image": "https://www.cnet.com/a/img/resize/c738f447edec70e373cabb12ef638a22e45e7f25/hub/2024/09/24/0704551a-1389-4368-98fd-521d6099a498/gettyimages-1786606343.jpg?auto=webp&fit=crop&height=675&width=1200", 
        "source": "CNET", 
        "summary": "- OpenAI CEO Sam Altman stated that \"superintelligent\" AI could be just a few thousand days away from being realized.\n- Altman emphasized the rapid advancements in AI technology and its potential to surpass human intelligence.\n- He highlighted the importance of preparing for the implications of superintelligent AI on society and the economy.\n- The CEO called for collaboration among researchers, policymakers, and industry leaders to ensure safe development.\n- Altman expressed concerns about the risks associated with superintelligent AI, including ethical and safety considerations.\n- He advocated for proactive measures to address potential challenges and ensure beneficial outcomes from advanced AI systems."
    }, 
    {
        "date": "09-29-24", 
        "title": "California's Gov. Newsom vetoes controversial AI safety bill, WSJ reports", 
        "body": "California Governor Gavin Newsom has vetoed an artificial intelligence safety bill as it applies only to the biggest and most expensive AI models and leaves others unregulated, the Wall Street Journal reported on Sunday,", 
        "url": "https://www.reuters.com/technology/artificial-intelligence/californias-gov-newsom-vetoes-controversial-ai-safety-bill-wsj-reports-2024-09-29/", 
        "image": "https://www.reuters.com/resizer/v2/6ETTQKTP2ZKMTBFT2IKEGOH2JA.jpg?auth=3dded593c0e95ce720c138da9b4f3a35d2d13d3ba724c898dab0bff6398eaeeb&height=1005&width=1920&quality=80&smart=true", 
        "source": "Reuters", 
        "summary": "- California Governor Gavin Newsom vetoed a controversial AI safety bill aimed at regulating artificial intelligence technologies.\n- The bill sought to establish safety standards and ethical guidelines for AI development and deployment.\n- Newsom expressed concerns that the legislation could hinder innovation and economic growth in the tech sector.\n- Supporters of the bill argued it was necessary to protect consumers from potential risks associated with AI.\n- The veto has sparked renewed debate over the balance between regulation and technological advancement in California.\n- Critics of the decision highlighted the need for regulatory frameworks to address issues like bias and misinformation in AI systems."
    }, 
    {
        "date": "09-29-24", 
        "title": "Sam Altman says learning AI will keep humans employed. Here's why else the robots might not take your job.", "body": "Sam Altman says students should learn AI to keep jobs. Meantime, a study found a lot of human skills weren't \"very likely\" to be replaced by GenAI.", "url": "https://www.businessinsider.com/ai-wont-take-as-many-jobs-as-feared-altman-2024-9", "image": "https://i.insider.com/66f71486de59ade1a3b57f00?width=1200&format=jpeg", 
        "source": "Business Insider", 
        "summary": "- OpenAI CEO Sam Altman believes that learning AI will help keep humans employed by enhancing their skills.\n- He argues that AI can complement human work rather than completely replace it, leading to new job opportunities.\n- Altman suggests that AI will automate repetitive tasks, allowing humans to focus on more complex and creative work.\n- The integration of AI into the workforce may lead to the creation of entirely new job categories that do not currently exist.\n- He emphasizes the importance of education and training to prepare the workforce for an AI-driven future.\n- Altman acknowledges concerns about job displacement but maintains that the overall impact of AI on employment may be less severe than feared."
    }, 
    {
        "date": "09-29-24", 
        "title": "Gov. Gavin Newsom vetoes AI safety bill opposed by Silicon Valley", 
        "body": "Gov. Gavin Newsom vetoed AI safety bill SB-1047, which was opposed by tech companies including ChatGPT maker OpenAI and Facebook parent company Meta.", 
        "url": "https://www.msn.com/en-us/news/other/gov-gavin-newsom-vetoes-ai-safety-bill-opposed-by-silicon-valley/ar-AA1rqkFO", 
        "image": "https://img-s-msn-com.akamaized.net/tenant/amp/entityid/AA1rqmwQ.img?w=840&h=560&m=4&q=74", 
        "source": "MSN", 
        "summary": "Summary unavailable due to unexpected error..."}]